"CIAdditionCompositing" = "加法";
"CIAffineClamp" = "仿射緊貼";
"CIAffineTile" = "仿射磚塊";
"CIAffineTransform" = "仿射變形";
"CIBarsSwipeTransition"="列擦過過場效果";
"CIBlendWithMask" = "以遮罩調和";
"CIBloom" = "光暈";
"CIBoxBlur"="方塊模糊";
"CIBumpDistortion" = "凹凸扭曲";
"CIBumpDistortionLinear"="凹凸扭曲線性";
"CICMYKHalftone" = "CMYK 半色調";
"CICheckerboardGenerator" = "棋盤式";
"CICircleSplashDistortion" = "環狀潑灑扭曲";
"CICircularScreen" = "環形螢幕";
"CICircularWrap" = "環形捲繞扭曲";
"CIColorControls" = "色彩控制";
"CIColorCube" = "色彩立方體";
"CIColorInvert" = "色彩負片效果";
"CIColorMap" = "色彩表";
"CIColorMatrix" = "色彩矩陣";
"CIColorMonochrome" = "單色";
"CIColorPosterize" = "色彩海報化";
"CIComicEffect" = "漫畫效果";
"CIConstantColorGenerator" = "常色";
"CICopyMachineTransition" = "影印機";
"CICrop" = "裁切";
"CICrystallize" = "結晶化";
"CIDiscBlur"="光碟模糊";
"CIDisintegrateWithMaskTransition" = "以遮罩分化";
"CIDisplacementDistortion" = "位移扭曲";
"CIDissolveTransition" = "溶解";
"CIDotScreen" = "螢幕網點";
"CIEdges" = "邊框";
"CIEdgeWork" = "邊框裝飾";
"CIEightfoldReflectedTile"="八倍反射的並排";
"CIExposureAdjust" = "曝光調整";
"CIFalseColor" = "假色";
"CIFastBoxBlur" = "快速方塊模糊";
"CIFastDiscBlur" = "快速光碟模糊";
"CIFlashTransition" = "閃光";
"CIFourfoldReflectedTile"="四倍反射的並排";
"CIFourfoldRotatedTile"="四倍旋轉的並排";
"CIFourfoldTranslatedTile"="四倍轉換的並排";
"CIGammaAdjust" = "光度調整";
"CIGaussianBlur" = "高斯模糊";
"CIGaussianGradient" = "高斯漸層";
"CIGlassDistortion" = "玻璃扭曲";
"CIGlassLozenge" = "玻璃菱形";
"CIGlideReflectedTile"="滑動反射的並排";
"CIGloom" = "暗化";
"CIHatchedScreen" = "影線螢幕";
"CIHeightFieldFromMask" = "遮罩高度區域";
"CIHexagonalPixellate"="六角形的像素化";
"CIHoleDistortion" = "洞孔扭曲";
"CIHueAdjust" = "彩度調整";
"CIKaleidoscope" = "萬花筒";
"CILanczosScaleTransform" = "Lanczos 刻度變形";
"CILenticularHaloGenerator" = "透鏡光暈";
"CILineOverlay" = "線疊置";
"CILineScreen" = "線條網螢幕";
"CILinearGradient" = "線性漸層";
"CIMaskToAlpha" = "遮罩至 Alpha";
"CIMaximumCompositing" = "最大值";
"CIMedianFilter" = "中間值";
"CIMinimumCompositing" = "最小值";
"CIModTransition" = "調變";
"CIMotionBlur" = "動態模糊";
"CIMultiplyCompositing" = "增加";
"CINoiseReduction" = "雜點消除";
"CIOpTile" = "Op 磚塊";
"CIPageCurlTransition" = "頁面捲曲";
"CIParallelogramTile" = "平行四邊形磚塊";
"CIPerspectiveTile" = "透視磚塊";
"CIPerspectiveTransform" = "透視變形";
"CIPinchDistortion" = "擠壓扭曲";
"CIPixellate" = "像素化";
"CIPointillize" = "點狀化";
"CIRadialGradient" = "放射漸層";
"CIRandomGenerator" = "隨機產生器";
"CIRippleTransition" = "漣漪";
"CISepiaTone" = "深褐色調";
"CIShadedMaterial" = "暗影材料";
"CISharpenLuminance" = "銳化亮度";
"CISixfoldReflectedTile"="六倍反射的並排";
"CISixfoldRotatedTile"="六倍旋轉的並排";
"CISourceAtopCompositing" = "來源於頂端";
"CISourceInCompositing" = "來源於內";
"CISourceOutCompositing" = "來源於外";
"CISourceOverCompositing" = "來源於上";
"CISpotColor" = "點顏色";
"CISpotLight" = "探照燈";
"CIStarShineGenerator" = "星光照射";
"CIStripesGenerator" = "條紋";
"CISunbeamsGenerator" = "日射";
"CISwipeTransition" = "刷擦";
"CITorusLensDistortion" = "環狀鏡頭扭曲";
"CITriangleTile" = "三角磚塊";
"CITwelvefoldReflectedTile"="十二倍反射的並排";
"CITwirlDistortion" = "旋轉扭曲";
"CIUnsharpMask" = "反銳化遮罩";
"CIVortexDistortion" = "漩渦扭曲";
"CIWhitePointAdjust" = "白點調整";
"CIZoomBlur" = "縮放模糊";
"CIColorBlendMode" = "色彩調和模式";
"CIColorBurnBlendMode" = "色彩加深調和模式";
"CIColorDodgeBlendMode" = "色彩加亮調和模式";
"CIDarkenBlendMode" = "加深調和模式";
"CIDifferenceBlendMode" = "差別調和模式";
"CIExclusionBlendMode" = "排除調和模式";
"CIHardLightBlendMode" = "強光調和模式";
"CIHueBlendMode" = "彩度調和模式";
"CILightenBlendMode" = "加亮調和模式";
"CILuminosityBlendMode" = "光度調和模式";
"CIMultiplyBlendMode" = "疊加調和模式";
"CIOverlayBlendMode" = "覆疊調和模式";
"CISaturationBlendMode" = "飽和調和模式";
"CIScreenBlendMode" = "濾網調和模式";
"CISoftLightBlendMode" = "柔光調和模式";
"CIAreaHistogram" = "區域直方圖";
"CIAreaMaximum" = "區域最大值";
"CIAreaMinimum" = "區域最小值";
"CIAreaMaximumAlpha" = "區域最大值 Alpha";
"CIAreaMinimumAlpha" = "區域最小值 Alpha";
"CIAreaAverage" = "區域平均值";
"CIRowAverage" = "橫列平均值";
"CIColumnAverage" = "直欄平均值";
"CIMinimumComponent" = "最小組件";
"CIMaximumComponent" = "最大組件";
